//================================================================================================================
// ReactionMove.cs
// 製作者：戸軽隆二
//================================================================================================================
/* 概要
		AttractionMoveの実行後に呼ばれるスクリプト。
		衝突した時の反動の動きを実装している。
		AttractionMoveがアタッチされているオブジェクトにこのスクリプトをアタッチする
*/
//================================================================================================================
// バージョン
//		1.0 クラス生成                               2017/03/08 戸軽隆二 
//		2.0 処理を自機だけに変更					 2017/04/18 戸軽隆二
//================================================================================================================
using UnityEngine;
using System.Collections;
using System.Collections.Generic;

public class ReactionMove : MonoBehaviour {
	//---------------------------------------------------------------
	// private変数
	List<GameObject> objects = new List<GameObject>();
	Vector3 startPos, gorlPos;
	bool moveFlg = false;
	float frame = 0;
	//---------------------------------------------------------------
	// public変数
	public float time = 0.6f;

	//================================================================================================================
	// 常に更新し続ける処理（60FPSで固定）
	//================================================================================================================
	void FixedUpdate () {
		if (moveFlg == true) {
			if(frame < time) {
				frame += Time.deltaTime;
				Vector3 pos = objects[0].transform.position;
				Vector3 dis = gorlPos - startPos;
				pos = startPos - (dis * (frame / time) );
				pos.y = startPos.y + ( (-1.0f + (frame / time) * 2) * (-1.0f + (frame / time) * 2) ) * -1 + 1;
				objects[0].transform.position = pos;
			}
			else {
				Initialize();
			}
		}
	}
	//================================================================================================================
	// 初期化の処理
	//================================================================================================================
	void Initialize() {
		frame = 0;
		moveFlg = false;
		Vector3 pos = objects[0].transform.position;
		pos.y = startPos.y;
		objects[0].transform.position = pos;
		objects = new List<GameObject>();
		startPos = new Vector3();
	}
	//================================================================================================================
	// メソッドを呼び出せば反動の処理を実行できる
	//================================================================================================================
	public void Reaction(List<GameObject> player) {
		moveFlg = true;     // Update実行
		objects = player;   // オブジェクトの情報を保存
		//-------------------------------------------------
		// スタート座標と目的の座標を保存
		startPos = objects[0].transform.position;
		gorlPos = objects[1].transform.position;
	}
	//================================================================================================================
	// プロパティ関数
	//================================================================================================================
	public bool MoveFlg { get { return moveFlg; } set { moveFlg = value; } }
}
