//================================================================================================================
// TowerSelect.cs
// 製作者：戸軽隆二
//================================================================================================================
/* 概要
		ステージ内のTowerオブジェクトを選択するクラス
		インスタンスを生成するとステージ内のTowerタグのオブジェクトを検索し、
		Change関数で選択しているオブジェクトを変更する。
		Object関数で選択中のTowerオブジェクトの情報にアクセス
*/
//================================================================================================================
// バージョン
//		1.0 クラス生成                               2017/04/18 戸軽隆二 
//================================================================================================================
using UnityEngine;
using System.Collections.Generic;

public class TowerSelect : MonoBehaviour {
	//------------------------------------------------
	// private変数
	List<GameObject> towers = new List<GameObject>();
	GameObject tower;
	int select = 0;
	//================================================================================================================
	// コンストラクタ
	//================================================================================================================
	public TowerSelect() {
		Serch();
	}
	//================================================================================================================
	// ステージ内の"Tower"タグのオブジェクトを検索
	//================================================================================================================
	void Serch () {
		towers = new List<GameObject>();
		// ステージに存在する柱を検索
		GameObject[] obj = GameObject.FindGameObjectsWithTag("Tower");
		for (int i = 0; i < obj.Length; i++) {
			towers.Add(obj[i]);
		}
	}
	//================================================================================================================
	// 選択中のオブジェクトを 1 と -1 で変更する
	//================================================================================================================
	public bool Change(int num) {
		// エラーの時は実行しない
		if (num != -1 && num != 1) return false;
		// Towerオブジェクトの数
		int sctMax = towers.Count;
		//------------------------------------------
		// ０～最大数の間でループする
		if ((select + num) < 0) {
			select = sctMax - 1;
		}
		else if ((select + num) > sctMax - 1) {
			select = 0;
		}
		else
			select += num;
		// 選択中のオブジェクトを反映
		tower = towers[select];
		return false;
	}
	//================================================================================================================
	// 選択中のオブジェクトにアクセス
	//================================================================================================================
	public GameObject Object() {
		if (tower == null) {
			return towers[0];
		}
		return tower;
	}
}